package java_study_1212;

public class 문제 {

	public static void main(String[] args) {
		//클래스 내에서 같은 이름의 메소드를 여러 개 정의하는 것을 무엇이라고 하는가?
		/*
		 *  a) 오버라이딩 *
		 *  b) 오버로딩
	        c) 캡슐화
	        d) 상속  
		 * 
		 */
		//2.(b)
	    
		//3. Java에서 메소드의 반환 타입을 지정하지 않을 때 사용하는 키워드는?
            (b)

        //4.다음 중 올바른 메소드 선언은? (b)
            a) public void myMethod();
            b) public void myMethod() { }
            c) public myMethod() { }
            d) void public myMethod() { }
            
         //5.(a)
            
         //6. 다음 중 메소드의 반환 타입을 올바르게 설명한 것은? (b)
         /*   a) 메소드가 실행되는 횟수를 나타낸다. 
              b) 메소드가 반환하는 값의 데이터 타입을 나타낸다. 
              c) 메소드의 매개변수 개수를 나타낸다. 
              d) 메소드의 접근 제어자를 나타낸다.
 
          //7.(c)
          //8. Calculator 클래스를 생성 후
            //두 정수를 매개변수로 받아 그 합을 반환하는 메소드 add를 작성하세요
            
            //10.객체를 생성할 때 사용하는 키워드는?
             /*
              *  a) class  
              *  b) new ^
                 c) this
                 d) static
              */
             
            //11.클래스의 주요 구성 요소가 아닌 것은? (d)
            
            //12.클래스 내에서 데이터를 저장하는 변수를 무엇이라고 하는가? (c)

            //13.클래스의 인스턴스를 생성할 때 자동으로 호출되는 특별한 메소드는?(b)
            
            
            
	}

}
